# Вариант 1
month_name = ("Зима","Зима", "Весна", "Весна", "Весна", "Лето", "Лето", "Лето", "Осень", "Осень",
    "Осень", "Зима")
try:
    month = int(input("Введите месяц числом: "))
    if 1 <= month <= 12:
        print(month_name[month - 1])
    else:
        print("Нет такого месяца!")
except Exception:
    print("Неверный ввод данных!")

# Вариант 2
month_name = { 1:"Зима", 2:"Зима", 3:"Весна", 4:"Весна", 5:"Весна", 6:"Лето", 7:"Лето", 8:"Лето", 
    9:"Осень", 10:"Осень", 11:"Осень", 12:"Зима" }
try:
    month = int(input("Введите месяц числом: "))
    if 1 <= month <= 12:
        print(month_name[month])
    else:
        print("Нет такого месяца!")
except Exception:
    print("Неверный ввод данных!")
    